cloud.org
#+TITLE: emacs-based secure cloud storage for text files
#+AUTHOR: Oleg Shalaev
#+EMAIL:  oleg@chalaev.com
#+LaTeX_HEADER: \usepackage[russian,english]{babel}
#+LATEX_HEADER: \usepackage[letterpaper,hmargin={1.5cm,1.5cm},vmargin={1.3cm,2cm},nohead,nofoot]{geometry}

Uses code from the [[https://notabug.org/shalaev/lisp-goodies][lisp-goodies]] project.

Github vs Emacs: since ~github~
1. does not understand ~org-mode~ internal links,
2. does not show calculation results from ~org~ files and
3. can not hide selected sections (thus making the web page too long),
consider opening this file in ~emacs~ instead of watching it online.

* Symmetric (en/de)cryption
All hosts (computers) are treated identically – there is no "main" host. This is why we use symmetric encryption
with automatically generated password. 
For (en/de)cryption, emacs will call shell commands similar to
#+BEGIN_SRC shell
gpg --batch --yes --pinentry-mode loopback --passphrase "somepass" -o /mnt/cloud/abc.gpg --symmetric ~/myFile.txt
gpg --batch --yes --pinentry-mode loopback --passphrase "somepass" -o ~/myFile.txt --decrypt /mnt/cloud/abc.gpg
#+END_SRC

* Initialization
Although [[https://stallman.org/][Stallman]] recommends not to use ~CL~, for now I am still requiring it.
** Local configuration
*** variables (configuration parameters)
Every element of ~file-DB~ is a vector having the following structure:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
(defvar file-fields; indices numerating array fields
(list
#+END_SRC
The order of the following variables must match the order of fields in =get-file-properties= function from the [[https://github.com/chalaev/lisp-goodies][lisp-goodies project]]:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
'plain; original (local) file name
'uname; (not used in this project) user name
'gname; group name
'mtime; modification time
'size; file size (should not be saved)
'modes; permissions
'cipher)); (a non-standard field) pseudonim used in remote (cloud) directory
(let((i 0))
 (dolist (field-name file-fields) (setf i (1+ (set field-name i)))))
#+END_SRC

The variables with the names starting with "cloud-" should probably be kept global; the others will be "localized".

=cloud-file-hooks= is used for special files (e.g., diary or bookmarks);
When those are copied from the cloud to the local hard drive, one should call, e.g., =diary-view-entries= or =bookmark-load=:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(define-vars (password; to be read from config or generated
(HOME (getenv "HOME")); must not have trailing "/"
(number-of-CPU-cores 1)
(black-root-dirs(split-string "/mnt/ /tmp/ /etc/ /ssh:"))
(black-matches (split-string "tmp /old /log /Downloads /.git/"))
cloud-file-hooks; "for special files treatment"
#+END_SRC
← for example, after we have updated local ~emacs-diary~ file from the cloud, we may want to re-scan it.

#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
upload-queue; "names of edited files"
added-files; "newly clouded files"
#+END_SRC

From time to time (e.g., when we =M-x cloud-sync=)  we synchronize local information
with the remote file whose (secret) name is stored in =remote/files=:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
remote/files; "3-symbol DB name on the server, e.g., WzT"
(localhost (system-name))
(~ (to-dir(expand-file-name "~")))
(remote-directory  "/mnt/cloud/")
#+END_SRC
← for portability it is better to avoid backslashes in path names.

#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(/tmp/cloud/ (need-dir (make-temp-file "cloud." t)))))
(defun /tmp/cloud/() (need-dir /tmp/cloud/))
(defun remote/files() remote/files)
(defun remote-directory() remote-directory)
(defun remote-files() (concat (remote-directory) remote/files ".gpg"))
(defun history() (concat (remote-directory) "history"))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
;; (defvar emacs-d "~/.emacs.d/") defined in shalaev.el
(define-vars ((cloud-was-connected t))); normally t, nill when there was no connection
#+END_SRC
← ~cloud-was-connected~ is set to ~nil~ when ~(cloud-sync)~ fails, and is set to ~t~ once =(read-fileDB)= succeeds.

Similarly to how they do it in ~JavaScript~, let me call the following functions "dynamic variables":
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el :shebang ";; -*-  mode: Emacs-Lisp; lexical-binding: t; -*-"
(defun local-dir() (need-dir emacs-d "cloud"))
(defun local/host/() (need-dir (local-dir) localhost))
(defun cloud-mk() (tilde(concat (local-dir) "cloud.mk")))
(defun lock-dir() (to-dir (remote-directory) "now-syncing"))
(defun image-passes() (concat (local-dir) "individual.passes"))
(defun local/() (need-dir (local-dir) localhost))
(defun local/log() (concat (local/) "log"))
#+END_SRC

Instead of storing configuration in =~/.emacs= I prefer to store it in a separate file:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defun local/host/conf() (concat (local/host/) "config"))
#+END_SRC
This is because
1. sometimes the code will update its configuration, and
2. in this way configuration data is more separated from other ~elisp~ programs.

*** creating (only once, during the first run)
Before we start for the very first time, when cloud directory is inexistent or empty, 
we create the password for encryption by =(cloud-init)=:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun cloud-init(&optional rem-dir) 
"initializes cloud directory and generates password -- runs only once"
(let ((remote-directory (ensure-dir-exists (or rem-dir remote-directory))))
#+END_SRC
For safety reasons refusing to initialize a directory already containing encrypted files:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(if (directory-files remote-directory nil "^.\+.gpg$" t)
    (clog :error "please clean the directory %s before asking me to initialize it" remote-directory)
(clog :info "will use (remote) unused directory %s as a cloud" remote-directory)
(ifn-set ((remote/files (new-file-name remote-directory)))
  (clog :error "could not create DB file in %s" remote-directory)
#+END_SRC
Generating random password and saving it in the local configuration file:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(unless password (setf password (rand-str 9)))
(reset-Makefile)
#+END_SRC
← one password for all text files – for now this software is designed for single person only, and I
do not see why should I use individual passwords for different text files.

#+begin_note
I already use individual passwords for images so (from the technical point of view) it is easy to use
individuall passwords for some (or all) text files ← might facilitate gradual password replacement.
#+end_note

The concept "one password for many text files" might be changed later if I ever upgrade the code for sharing files within a group of people;
but if this happens, I will probably have to abandon symmetric encryption and deal with public/private keys.
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(ensure-dir-exists (local-dir)) (write-conf)
(clog :info "saved local configuration in %s" (local-dir))))))
#+END_SRC
← end of =cloud-init=.

See [[file:testing.org][testing.org]] about multi-scale testing:
#+BEGIN_SRC emacs-lisp :tangle generated/meso.el
(ert-deftest cloud-init()
   "just check that non-empty config file is created during the first run"
(one-virgin-host nil nil
  (should (progn
  (cloud-init remote-directory) 
(when-let ((FR (cloud-get-file-properties (concat emacs-d "cloud/" localhost "/config")))
           (FSize (aref (get-file-properties* (concat emacs-d "cloud/" localhost "/config")) size)))
    (clog :info "deftest cloud-init: config file size = %d bytes" FSize)
(< 100 FSize))))))
#+END_SRC

*** reading and writing
By default we assume that our configuration parameters have a string value. There are exceptions:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(define-vars ((numerical-parameters '("number-of-CPU-cores"))
              (lists-of-strings (split-string "black-extensions black-root-dirs black-matches"))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun format-conf(CP)
(ifn-let((SVI (symbol-value(intern CP)))) ""
(cond
  ((member CP numerical-parameters) (format "%s=%d" CP SVI))
  ((member CP lists-of-strings) (format "%s=%s" CP
(apply #'concat (mapcar #'(lambda(item) (format "%s " item)) (sort SVI #'string<)))))
  (t (format "%s=%s" CP SVI)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/tests/micro.el :shebang ";; -*-  lexical-binding: t; -*-"
;; These are "microscopic" tests, on microscopic scale: they test single functions in a stabdard environment
;; If a "microscopic" test fails, it generally makes no sence to run larger-scale (mesoscopic and mesoscopic) tests.
(require 'ert)

(ert-deftest format-conf()
(let ((remote-directory "/mnt/my-cloud/")
      (number-of-CPU-cores 123)
      (black-root-dirs '("/abc/" "/def/")))
(should (string= "remote-directory=/mnt/my-cloud/"   (format-conf "remote-directory")))
(should (string= "number-of-CPU-cores=123" (format-conf "number-of-CPU-cores")))
(should (string= "black-root-dirs=/abc/ /def/ " (format-conf "black-root-dirs")))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun write-conf()
(with-temp-file (local/host/conf)
(mapcar #'(lambda(CP) (insert(format-conf CP)) (newline))
 (split-string "black-matches black-matches black-root-dirs remote-directory black-extensions remote/files number-of-CPU-cores password")))
 t)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun read-conf()
  "reads configuration file"
(let ((conf0 (read-conf-file(local/host/conf))) conf1)
(ifn conf0 (clog :error "refuse to work until you specify 3-symbol contents name \"remote/files\" in %s" (local/host/conf))
(dolist (CP (mapcar #'car conf0))
(push(cons CP 
(let((val (cdr(assoc CP conf0))))
    (cond
((member CP numerical-parameters) (string-to-number val))
((member CP lists-of-strings)  (split-string val))
(t (car (split-string val))))))
conf1))
(reverse conf1))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/meso.el
(ert-deftest read-write-conf()
   "testing cloud-init, read-conf, and write-conf"
(one-virgin-host nil nil (cloud-init)
(clog :info "read-write-conf: (local/host/conf) => %s" (local/host/conf))
(clog :info "
Here is the generated config file: ==>")
(with-temp-buffer (insert-file-contents (local/host/conf))
(while-let (str) (< 0 (length (setf str (read-line)))) (clog :info "%s" str)))
(clog :info "<== end of config file
")
(should (listp black-extensions))
(should (< 0 (length black-extensions)))
(should (land (mapcar #'stringp black-extensions)))
(should (listp black-root-dirs))
(should (< 0 (length black-root-dirs)))
(should (land (mapcar #'stringp black-root-dirs)))
(should (land (mapcar #'stringp (list remote/files remote-directory password))))
(let ((remote-directory "/mnt/remote/galaxy/")
      (black-extensions '("abc" "def"))
      (black-root-dirs '("/trash/"))
      (remote/files "QWERTY")
      (password "myDogsName"))
(write-conf))
(clog :info "
Here is my artificial config file: ==>")
(with-temp-buffer (insert-file-contents (local/host/conf))
  (while-let (str) (< 0 (length (setf str (read-line)))) (clog :info "%s" str)))
(clog :info "<== end of config file
")
(let((conf(read-conf)) remote-directory black-extensions black-root-dirs remote/files number-of-CPU-cores password remote-directory password)
(should conf)
(update-conf conf (split-string "remote-directory black-extensions black-root-dirs remote/files number-of-CPU-cores password"))
(should (string= remote-directory "/mnt/remote/galaxy/"))
(should (equal black-extensions '("abc" "def")))
(should (equal black-root-dirs '("/trash/")))
(should (string= remote/files "QWERTY"))
(should (string= password "myDogsName")))))
#+END_SRC

** Host/Action/File information
*** general
We got three variables (or databases) describing
1. host names participating in file synchronization,
2. actions to be performed on other hosts, and
3. names of the clouded files:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(define-vars (cloud-hosts; host names participating in file synchronization
remote-actions; actions to be saved in the cloud
file-DB; list of vectors, each corresponding to a clouded file
#+END_SRC
← The content of these variables is stored
1. in RAM: (=cloud-hosts=, =remote-actions=, =file-DB=),
2. in local file named =(local/all)=
3. on the server, in a file named =remote/files=.

We have to manually blacklist files generated by emacs, see ~README.md~ stanza in [[file:Makefile][Makefile]]:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
file-blacklist
#+END_SRC
← temporary or system or remote directories.  (Trying to use here the same notations, as in [[https://github.com/chalaev/el-backup][el-backup]].)

Suppose we opened a ~dired~ buffer, and =M-x cloud-add= on a directory. Files with certain extensions in the (sub)directory should not be clouded by default:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(black-extensions(split-string
"ac3 afm aux idx ilg ind avi bak bbl blg brf bst bz2 cache chm cp cps dat deb dvi dv eps fb2 fn fls img iso gpx segments ky mjpeg m md mov mpg mkv jpg gif jpeg png log mp3 mp4 m2v ogg ogm out part pbm pdf pfb pg pod pgm pnm ps rar raw gz sfd woff tbz tgz tga tif tiff toc tp vob vr wav xcf xml xz Z zip"))))
#+END_SRC
← files with these extensions will not be *automatically* clouded.

*** hosts and actions
The content of ~file-DB~ is locally stored in the file named =(local/all)=:
#+BEGIN_SRC emacs-lisp :tangle generated/variables.el
(defun local/all() (concat (local/) "all"))
#+END_SRC

*** printing
